tutorials/granularEulerFoam/biomassInclinedFlow/pauliquen21/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

#include "../parameters";


zT 0.001;

vertices
(
 (0 0 0)//0 ($x01 0 0)//1
 ($x1 $y1 0)//1
 ($x2 $y2 0)//2
 ($x3 $y3 0)//3
 ($x4 $y4 0)//4
 ($x5 $y5 0)//5
 ($x6 $y6 0)//6
 ($x7 $y7 0)//7 ($x8 $y8 0)//8
 ($x8 $y8 0)//8
 ($x9 $y9 0)//9
 ($x10 $y10 0) //10
 (0 0 $zT)//11
 ($x1 $y1 $zT)//12
 ($x2 $y2 $zT)//13
 ($x3 $y3 $zT)//14
 ($x4 $y4 $zT)//15
 ($x5 $y5 $zT)//16
 ($x6 $y6 $zT)//17
 ($x7 $y7 $zT)//18
 ($x8 $y8 $zT)//19
 ($x9 $y9 $zT)//20
 ($x10 $y10 $zT)//21
 ($x22 $y22 0)//22
 ($x22 $y22 $zT)//23
);


blocks
(
  hex (0 1 22 4 11 12 23 15) ($floorX $ly $dz) simpleGrading (1 1 1) // lower
  hex (4 22 5 10 15 23 16 21) ($floorX $uy $dz) simpleGrading (1 1 1)
 hex (2 0 4 6 13 11 15 17) ($rampX $ly $dz) simpleGrading (1 1 1) //lower
 hex (3 2 6 7 14 13 17 18) ($boxX $ly $dz) simpleGrading (1 1 1) // lower
 hex (6 4 10 8 17 15 21 19) baffleBlock1 ($rampX $uy $dz) simpleGrading (1 1 1)
 hex (7 6 8 9 18 17 19 20) baffleBlock2 ($boxX $uy $dz) simpleGrading (1 1 1)
);

edges
(
);

patches
(
 wall left
   (
    (3 7 18 14)
    (7 9 20 18)
   )
 atmosphere right
   (
    //(4 0 11 15)
    //(10 4 15 21)
    (5 22 23 16)
    (22 1 12 23)
   )
 wall ramp
  (
  (2 3 14 13)
  (0 2 13 11)
  )
 atmosphere top
   (
    (8 10 21 19)
    (9 8 19 20)
        (10 5 16 21)
   )
atmosphere bottom
   (
    (0 1 12 11)
   )
);

mergePatchPairs
(
);

// ************************************************************************* //
