tutorials/granularEulerFoam/biomassInclinedFlow/pauliquen21/0/k.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 1;

boundaryField
{
  left
    {
        type               kqRWallFunction;
        value              $internalField;
    }
  ramp
    {
        type               kqRWallFunction;
        value              $internalField;
    }
  top
    {
        type               inletOutlet;
        phi                phi.air;
        inletValue         $internalField;
        value              $internalField;
    }
  right
    {
        type               inletOutlet;
        phi                phi.air;
        inletValue         $internalField;
        value              $internalField;
    }
  bottom
   {
        type               inletOutlet;
        phi                phi.air;
        inletValue         $internalField;
        value              $internalField;
   }
  defaultFaces
    {
          type             empty;
    }

}



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
